{
    "Hello":{
        "German" : "Vielen Dank, dass Sie an dieser Studie teilnehmen.\n\nIhre Aufgabe ist es, die gezeigten (kleinen) Java-Programme zu verstehen, sodass Sie im Anschluss eine Frage zur Funktionalität des Programms beantworten können.\n\nJedes dieser kleinen Programme kann bis zu 3 Minuten betrachtet werden.\nSie können aber auch jederzeit mit <Leertaste> fortfahren.\n\n<Weiter mit Leertaste>",
        "English": "Thank you for participating in this study.\n\n Your task is to comprehend the presented (simple) Java programs, so that you can answer a question about the functionality of the program afterwards.\n\nEach of these small programs is shown for up to 3 minutes.\nHowever, you can also continue at any time by pressing <spacebar>.\n\n<Continue with spacebar>"
    },
    "Instructions":{
        "German" : "Der Code ist immer syntaktisch korrekt, also ausführbar.\n\nFunktionsnamen, Codestruktur, Variablen etc. können ungewöhnlich sein. Lassen Sie sich davon nicht irritieren und lösen Sie die Aufgabe so gut wie möglich.\n\nDie zur Verfügung stehende Zeit ist sehr knapp! Das Experiment ist bewusst anspruchsvoll ausgelegt, sodass nicht alle Aufgaben gelöst werden können.\n\nFür \"Weiter\" immer die Leertaste drücken.",
        "English": "The code is always syntactically correct, i.e. executable.\n\nFunction names, code structure, variables, etc. may be unusual. Do not let this bother you and solve the task as best you can.\n\nThe time available is very short! The experiment is deliberately designed to be demanding, so that not all tasks can be solved.\n\nAlways press the spacebar for \"Next\"."
    },
    "Instructions2":{
        "German" : "Bitte antworten Sie nur, wenn Sie das Ergebnis auch kennen.\n\nGenau wie in diesem Beispiel wird Ihnen immer ein Funktionsaufruf präsentiert werden, und Sie sollen die korrekte Ausgabe auswählen.\n\nBitte raten Sie nicht, sondern wählen Sie \"next\". \"next\" ist besser, als eine Antwort zu raten. Am Wichtigsten ist jedoch, dass Sie sich nicht frustrieren lassen :)\n\nHaben Sie noch Fragen vor dem Trainingsbeispiel?\n\n<Weiter zum Trainingsbeispiel>",
        "English": "Please answer only if you know the result.\n\nJust like in this example, you will always be presented with a function call and asked to choose the correct output.\n\nPlease do not guess, but choose \"next\". \"next\" is better than guessing an answer. Most importantly: Don't get frustrated :)\n\nDo you have any questions before we start with a training example?\n\n<Continue with spacebar>"
    },
    "Hello_World": {
        "German" : "Program Comprehension\n<Weiter mit Leertaste>",
        "English": "Program Comprehension\n<Continue with spacebar>"
    },
    "Input": {
        "German" : "Hier wird die Methode von eben aufgerufen.\nWie lautet die Ausgabe?\nAntwortmöglichkeiten folgen:\n<Weiter mit Leertaste>",
        "English": "The method from before is called.\nWhat is the output?\nAnswer options follow:\n<Continue with spacebar>"
    },
    "Output": {
        "German" : "Wählen Sie mit den Pfeiltasten die passende Ausgabe.\nWenn keine der Antwortmöglichkeiten passt, wählen Sie bitte \"next\".",
        "English": "Use the arrow keys to select the appropriate output.If none of the answer choices fit, please select \"next\"."
    },
    "TrainingSnippet": {
        "German" : "Program Comprehension",
        "English": "Program Comprehension"
    },
    "Crossexplain": {
        "German" : "Zwischen den einzelnen Aufgaben machen wir eine 30-sekündige Pause, in der Sie sich bitte auf das Kreuz in der Mitte konzentrieren. Nutzen Sie diese Zeit, um sich zu entspannen.",
        "English": "Between each task, we will take a 30-second break where you should focus on the cross in the middle. Use this time to relax :)"
    },
    "Question": {
        "German" : "Haben Sie noch Fragen?",
        "English": "Do you have any questions?"
    },
    "SyntaxInstruction": {
        "German" : "Nun kennen Sie einen der beiden Aufgabentypen. Der andere Aufgabentyp heißt “Search ”. Wir zeigen Ihnen ein Java-Programm, dabei ist Ihre Aufgabe so schnell wie möglich für jede der offenen Klammer \"(\" oder \"{\" einmal die <Pfeiltaste unten> zu drücken. Wenn Sie fertig sind, drücken Sie <Leertaste>.\nAchtung! Wir suchen nur die offenen Klammern \"(\" und \"{\",\nandere Klammern, wie beispielsweise },), [, ] sollen ignoriert werden.",
        "English": "Now you know one of the two task types. The other task type is called \"Search\". We will show you a Java program, your task is to press the <arrow key down> as fast as you can for each of the open parentheses \"(\" or \"{\" once. When you are done, press <spacebar>.\nImportant: We are only looking for the open brackets \"(\" and \"{\",\n other brackets, such as },), [, ] should be ignored."
    },
    "SampleSyntax": {
        "German" : "Hilfestellung: Klammer gefunden: <Pfeiltaste unten>\n\n<Weiter mit Leertaste>",
        "English": "Help: Bracket found: <arrow key down>.\n\n<Continue with spacebar>"
    },
    "Overview": {
        "German" : "Insgesamt machen wir 3 Durchläufe a 20 Minuten.\n\nZwischen den Durchläufen machen wir eine 5 Minuten Pause.\nDazu werden wir Ihnen während der 30s Pause Bescheid sagen.\nIn dieser Zeit können Sie sich strecken, wir lüften und kontrollieren den korrekten Sitz der EEG Kappe.\n\n<Weiter mit Leertaste>",
        "English": "We make a total of 3 runs of 20 minutes each.\n\nBetween the runs we will take a 5 minute break.\n\nFor this, we will let you know during the 30s break.\n\nDuring this time you can stretch, we will ventilate and check the correct fit of the EEG cap.\n\n<Continue with spacebar>"
    },
    "DoNotMove": {
        "German" : "Auf der nächsten Folie startet die Studie.\nBitte bewegen Sie sich so wenig wie möglich, da Muskelbewegungen die EEG-Daten beeinflussen. Dazu zählt auch Zähneknirschen oder Murmeln. Bleiben Sie so entspannt wie möglich :)",
        "English": "On the next slide, the study will start.\nPlease move as little as possible, as muscle movements affect the EEG data. This includes grinding your teeth or mumbling. Stay as relaxed as possible :)"
    },
    "BeforeSearchTask": {
        "German" : "Nun folgt eine Search Aufgabe.\nWir suchen die offenen Klammern: (, {\nKlammer gefunden: <Pfeiltaste unten>\nFertig: <Leertaste>",
        "English": "SearchReminder\nNow follows a Search Task.\nWe search for the open parentheses: (, {\nBracket found: <arrow key down>\nDone: <spacebar>"
    },
    "Continue": {
        "German" : "Möchten Sie weiter machen?",
        "English": "Do you want to continue?"
    }
}